---
kind: type
id: T:Autodesk.Revit.UI.IFrameworkElementCreator
source: html/1d9d89a7-e253-97a5-504b-dc8518843d00.htm
---
# Autodesk.Revit.UI.IFrameworkElementCreator

Interface that the Revit UI will call, if present, to construct the FrameworkElement
 for the pane.

## Syntax (C#)
```csharp
public interface IFrameworkElementCreator
```